InformationRegisters/ОчередьИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОчередьИнтеграции</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДанныеJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОчередиИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ID_Внешний</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыОчередиИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыОчередиИнтеграции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОбъектовИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОбъектовИнтеграции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мастера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Транзакции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Клиенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Записи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроверкаСвязи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ОказаниеУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОказаниеУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Бонусы</xr:Item>
				<xr:Item>AccumulationRegister.ПродажаУслуг</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мастера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНачисления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ID_Визита_YClients</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID_Транзакции_YClients</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Клиенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Клиенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ID_YClients</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ID_YClients</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ЮклайнсОбработкаОчереди/Ext/Module.bsl
// ВСЕ ПРОЦЕДУРЫ ПО ОБРАБОТКЕ ОБЪЕКТА НАЗЫВАТЬ ОбработатьОбъект_ЗначениеИзПеречисления




// Обрабатывает очередь интеграции с Юклайнс, выбирает записи со статусом "Новый", выполняет их обработку и устанавливает итоговый статус.
Процедура ОбработатьОчередьИнтеграции() Экспорт
	Настройки = ЮклайнсAPI.Настройки();
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ ПЕРВЫЕ " + Формат(Настройки.ЮклайнсРазмерПачки, "ЧГ=0") + "
	|	Очередь.ТипОбъекта КАК ТипОбъекта,
	|	Очередь.ID_Внешний КАК ID_Внешний,
	|	Очередь.ДанныеJSON КАК ДанныеJSON
	|ИЗ
	|	РегистрСведений.ОчередьИнтеграции КАК Очередь
	|ГДЕ
	|	Очередь.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОчередиИнтеграции.Новый)
	|УПОРЯДОЧИТЬ ПО
	|	Очередь.ДатаСоздания ВОЗР";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЮклайнсОчередьСервер.НоваяЗаписьВРегистрОчереди(Выборка.ТипОбъекта, Выборка.ID_Внешний, Выборка.ДанныеJSON, Перечисления.СтатусыОчередиИнтеграции.ВРаботе);	
		ТекстОшибки = "";
		Успех = Ложь;
		Данные = РаботаСJSON.Десериализовать(Выборка.ДанныеJSON);
		ИмяМетода = Перечисления.ВидыОбъектовИнтеграции.ОбработкаОбъектаИнтеграции(Выборка.ТипОбъекта);
			Попытка
				Выполнить(ИмяМетода + "(Данные, Успех)");
			Исключение
				Инфо = ИнформацияОбОшибке();
				ТекстОписания = КраткоеПредставлениеОшибки(Инфо);
				Если СтрНайти(ТекстОписания, "Процедура или функция с указанным именем не определена",) > 0 Тогда
			        ТекстОшибки = "Критическая ошибка архитектуры: Метод " + ИмяМетода + " не найден в модуле!";
			    Иначе
			        ТекстОшибки = ПодробноеПредставлениеОшибки(Инфо);
			    КонецЕсли;
			КонецПопытки;
		СтатусИтог = ?(Успех И ПустаяСтрока(ТекстОшибки), 
		               Перечисления.СтатусыОчередиИнтеграции.Обработан, 
		               Перечисления.СтатусыОчередиИнтеграции.Ошибка);
		ЮклайнсОчередьСервер.НоваяЗаписьВРегистрОчереди(Выборка.ТипОбъекта, Выборка.ID_Внешний, Выборка.ДанныеJSON, СтатусИтог, ТекстОшибки);
	КонецЦикла;
КонецПроцедуры

// Обрабатывает объект услуги, извлекает из него наименование и цену, выполняет поиск или создание услуги
//
// Параметры:
//   Услуга - Объект - объект с методами id и Свойство(), содержащий данные услуги
//   Успех - Булево - признак успешной обработки (возвращаемое значение, Истina если услуга найдена или создана)
Процедура ОбработатьОбъект_Услуги(Услуга, Успех) Экспорт
    Успех = Ложь;
    ID_Услуги = Строка(Услуга.id);
    Название  = "";
    Цена      = 0;
    Услуга.Свойство("title", Название);
    Услуга.Свойство("price_min", Цена);
    
    Если НЕ ПустаяСтрока(Название) Тогда
	    НайтиИлиСоздатьУслугу(Название, Цена, ID_Услуги);
	    Успех = Истина;
    КонецЕсли;
КонецПроцедуры
//На данный момент не реализованно, Клиенты загружаются с транзакциями
Процедура ОбработатьОбъект_Клиенты(Клиент, Успех) Экспорт
    Успех = Ложь;
    ID_Клиента = Строка(Клиент.id);
    ИмяКлиента  = "";
    Клиент.Свойство("name", ИмяКлиента);
    
    Если НЕ ПустаяСтрока(ИмяКлиента) Тогда
  //      НайтиИлиСоздатьКлиента(ИмяКлиента, ID_Клиента);
        Успех = Истина;
    КонецЕсли;

КонецПроцедуры

// Обновляет данные визита на сервере Юклайнс на основе переданной записи JSON
//
// Параметры:
//   Запись - Объект, Структура - запись визита с полями id, staff_id, client, date, last_change_date, payment_status, deleted
//   Успех - Булево - признак успешного выполнения операции
Процедура ОбработатьОбъект_Записи(Запись, Успех) Экспорт
	Успех = Ложь;
	ID_Записи = Строка(Запись.id);
	ПараметрыВизита = Новый Структура;
	ПараметрыВизита.Вставить("ID_Визита", ID_Записи);
	ПараметрыВизита.Вставить("ID_Мастера", Строка(Запись.staff_id));
	ПараметрыВизита.Вставить("ID_Клиента_ЮК", Строка(Запись.client.id));
	ПараметрыВизита.Вставить("ДанныеJSON", РаботаСJSON.Сериализовать(Запись));
	ПараметрыВизита.Вставить("ДатаВизита", РаботаСJSON.СтрокуВДату(Запись.date));
	ПараметрыВизита.Вставить("ПоследняяДатаИзменения", РаботаСJSON.СтрокуВДату(Запись.last_change_date));
	ПараметрыВизита.Вставить("Удален", ?(Запись.Свойство("deleted"), Запись.deleted, Ложь));
	ПараметрыВизита.Вставить("СтатусОплатыВизита", Запись.payment_status);
	Попытка
		ЮклайнсДанныеСервер.ОбновитьДанныеВизита(ПараметрыВизита);
		Успех = Истина;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

// Обрабатывает транзакцию, создавая клиента, услугу и документ оказания услуг.
//
// Параметры:
//   Транзакция - Структура - данные транзакции с полями id, record_id, amount, client
//   Успех - Булево - признак успешности обработки транзакции (выходной параметр)
Процедура ОбработатьОбъект_Транзакции(Транзакция, Успех) Экспорт
	Успех = Ложь;
	
	ID_Транзакции = Строка(Транзакция.id);
	ID_Визита     = Строка(Транзакция.record_id);
	СуммаОплаты   = Транзакция.amount;
	МастерСсылка = ЮклайнсДанныеСервер.ПолучитьМастераИзВизита(ID_Визита);
	
	Телефон = "";
	Имя     = "Неизвестный клиент";
	Если Транзакция.Свойство("client") И Транзакция.client <> Неопределено Тогда
		Транзакция.client.Свойство("phone", Телефон);
		Транзакция.client.Свойство("name",  Имя);
	КонецЕсли;
	
	Если ПустаяСтрока(Телефон) Тогда
		Возврат;
	КонецЕсли;
	
	КлиентСсылка = НайтиИлиСоздатьКлиента(Телефон, Имя);
	
	УслугаID = Строка(Транзакция.sold_item_id);
    УслугаСсылка = НайтиИлиСоздатьУслугу("", 0, УслугаID); 
    
    СтрУслуги = Новый Структура;
    СтрУслуги.Вставить("Номенклатура",  УслугаСсылка);
    СтрУслуги.Вставить("Количество",    1); 
    СтрУслуги.Вставить("Сумма",         Транзакция.amount);
    СтрУслуги.Вставить("ID_Транзакции", ID_Транзакции);
	
	Попытка
		СоздатьИлиОбновитьДокументОказаниеУслуг(ID_Визита, МастерСсылка, КлиентСсылка, СуммаОплаты, СтрУслуги);
		Успех = Истина;
	Исключение
		ВызватьИсключение; 
	КонецПопытки;
	
КонецПроцедуры

// Обрабатывает объект мастера, получая его идентификатор и название для поиска или создания записи в справочнике.
//
// Параметры:
//   Мастер - Произвольный - объект, содержащий свойства id и name
//   Успех - Булево - признак успешной обработки объекта
Процедура ОбработатьОбъект_Мастера(Мастер, Успех) Экспорт
	Успех = Ложь;
	ID_Мастера = Строка(Мастер.id);
	Название = "";
	Мастер.Свойство("name", Название);
	Если НЕ ПустаяСтрока(Название) Тогда
		НайтиИлиСоздатьМастера(ID_Мастера, Название);
		Успех = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Ищет элемент справочника Мастера по идентификатору из YClients. Создает новый элемент, если не найден. Обновляет наименование, если изменилось.
//
// Параметры:
//   ID_Мастера - Строка, Число - идентификатор мастера в системе YClients
//   Имя - Строка - наименование мастера
//
// Возвращаемое значение:
//   СправочникСсылка.Мастера - ссылка на найденный или созданный элемент справочника
Функция НайтиИлиСоздатьМастера(ID_Мастера, Имя) Экспорт
	Ссылка = Справочники.Мастера.НайтиПоРеквизиту("ID_YClients", ID_Мастера);
	
	Если Ссылка.Пустая() Тогда
		Объект = Справочники.Мастера.СоздатьЭлемент();
		Объект.Наименование = Имя;
		Объект.ID_YClients = ID_Мастера;
		Объект.Записать();
		Возврат Объект.Ссылка;
	Иначе
		Если Ссылка.Наименование <> Имя Тогда
			Объект = Ссылка.ПолучитьОбъект();
			Объект.Наименование = Имя;
			Объект.ID_YClients = ID_Мастера;
			Объект.Записать();
		КонецЕсли;
		Возврат Ссылка;
	КонецЕсли;
КонецФункции

// Находит клиента в справочнике по номеру телефона или создает нового клиента, если не найден
//
// Параметры:
//   Телефон - Строка - номер телефона клиента для поиска
//   Имя - Строка - наименование клиента для создания
//
// Возвращаемое значение:
//   СправочникСсылка.Клиенты - ссылка на найденного или созданного клиента
Функция НайтиИлиСоздатьКлиента(Телефон, Имя) Экспорт
	
	Клиент = Справочники.Клиенты.НайтиПоРеквизиту("НомерТелефона", Телефон);
	Если Клиент.Пустая() Тогда
		НовыйКлиент = Справочники.Клиенты.СоздатьЭлемент();
		НовыйКлиент.Наименование = Имя;
		НовыйКлиент.НомерТелефона = Телефон;
		НовыйКлиент.Записать();
		Возврат НовыйКлиент.Ссылка;
	КонецЕсли;
	Возврат Клиент;
	
КонецФункции

// Создает или обновляет документ ОказаниеУслуг для визита и добавляет строку услуги, если она не была добавлена ранее
//
// Параметры:
//   ID_Визита - Строка - идентификатор визита из YClients
//   Мастер - СправочникСсылка.ФизическиеЛица - мастер, выполняющий услуги
//   Клиент - СправочникСсылка.Контрагенты - клиент визита
//   СуммаВизита - Число - общая сумма визита
//   СтрУслуги - Структура - содержит данные об услуге с ключами: Номенклатура (СправочникСсылка.Номенклатура), Количество (Число),
//                 Сумма (Число), ID_Транзакции (Строка)
Процедура СоздатьИлиОбновитьДокументОказаниеУслуг(ID_Визита, Мастер, Клиент, СуммаВизита, СтрУслуги) Экспорт
	
	ДокСсылка = Документы.ОказаниеУслуг.НайтиПоРеквизиту("ID_Визита_YClients", ID_Визита);
    
    Если ДокСсылка.Пустая() Тогда
        ДокОбъект = Документы.ОказаниеУслуг.СоздатьДокумент();
        ДокОбъект.Дата = ТекущаяДатаСеанса();
        ДокОбъект.ID_Визита_YClients = ID_Визита;
        ДокОбъект.Клиент = Клиент;
        ДокОбъект.Мастер = Мастер;
    Иначе
        ДокОбъект = ДокСсылка.ПолучитьОбъект();
    КонецЕсли;
    
    ПараметрыПоиска = Новый Структура("ID_Транзакции_YClients", СтрУслуги.ID_Транзакции);
    НайденныеСтроки = ДокОбъект.Услуги.НайтиСтроки(ПараметрыПоиска);
    
    Если НайденныеСтроки.Количество() = 0 Тогда
        НоваяСтр = ДокОбъект.Услуги.Добавить();
        НоваяСтр.Номенклатура = СтрУслуги.Номенклатура;
        НоваяСтр.Количество   = СтрУслуги.Количество;
        НоваяСтр.Сумма        = СтрУслуги.Сумма;
        НоваяСтр.ID_Транзакции_YClients = СтрУслуги.ID_Транзакции;
        
        ДокОбъект.СуммаНачисления = ДокОбъект.СуммаНачисления + (СтрУслуги.Сумма * Константы.ДоляОплатыВБонусы.Получить());
        
        ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
    КонецЕсли;
	
КонецПроцедуры

// Находит услугу в справочнике Номенклатура по идентификатору из YClients, создает новую при отсутствии или обновляет наименование и цену
//
// Параметры:
//   НазваниеУслуги - Строка - наименование услуги
//   ЦенаУслуги - Число - цена услуги
//   ID_Услуги - Строка - уникальный идентификатор услуги в системе YClients
//
// Возвращаемое значение:
//   СправочникСсылка.Номенклатура - ссылка на найденную или созданную услугу
Функция НайтиИлиСоздатьУслугу(НазваниеУслуги, ЦенаУслуги, ID_Услуги) Экспорт
	Ссылка = Справочники.Номенклатура.НайтиПоРеквизиту("ID_YClients", ID_Услуги);
	
	Если Ссылка.Пустая() Тогда
		Объект = Справочники.Номенклатура.СоздатьЭлемент();
		Объект.Наименование = НазваниеУслуги;
		Объект.ID_YClients  = ID_Услуги;
		 Если Объект.Метаданные().Реквизиты.Найти("Цена") <> Неопределено Тогда
            Объект.Цена = ЦенаУслуги;
        КонецЕсли;
		Объект.Записать();
		Возврат Объект.Ссылка;
	Иначе
		НужноОбновить = Ложь;
        Если Ссылка.Наименование <> НазваниеУслуги Тогда
            НужноОбновить = Истина;
        ИначеЕсли Ссылка.Цена <> ЦенаУслуги Тогда
            НужноОбновить = Истина;
		КонецЕсли;
		
		Если НужноОбновить Тогда
            Объект = Ссылка.ПолучитьОбъект();
            Если НЕ ПустаяСтрока(НазваниеУслуги) Тогда
		        Объект.Наименование = НазваниеУслуги;
		    КонецЕсли;
		    Если ЦенаУслуги > 0 Тогда
		        Объект.Цена = ЦенаУслуги;
		    КонецЕсли;
			Попытка
                Объект.Записать();
			Исключение
				ДанныеЛога = Новый Структура("Объект, Сообщение, ДопДанные", Объект, "Ошибка в обновлении услуги", ОписаниеОшибки());
				ЛогированиеПриложений.Ошибка("НайтиИлиСоздатьУслугу.Ошибка", ДанныеЛога);
			КонецПопытки;
		КонецЕсли;
		Возврат Ссылка;
	КонецЕсли;
КонецФункции
